INSERT INTO `permission` VALUES ('2784', '2017-06-26 02:22:13', '2017-06-26 02:22:13', '0', 'WUYE_ADMIN_抽检功能', '抽检功能', 'MENU', '', '', '', '', '1', 'TRUE', 'WUYE_ADMIN'),
  ('2785', '2017-06-26 02:22:13', '2017-06-26 02:22:13', '2784', 'WUYE_ADMIN_抽检任务', '抽检任务', 'MENU', '/samplingset', '', '', '', '1', 'TRUE', 'WUYE_ADMIN'),
  ('2786', '2017-06-26 02:22:13', '2017-06-26 02:22:13', '0', 'WUYE_ADMIN_巡更功能', '巡更功能', 'MENU', '', '', '', '', '1', 'TRUE', 'WUYE_ADMIN'),
  ('2787', '2017-06-26 02:22:13', '2017-06-26 02:22:13', '2786', 'WUYE_ADMIN_巡更任务', '巡更任务', 'MENU', '/patrollocation', '', '', '', '1', 'TRUE', 'WUYE_ADMIN'),
  ('2789', '1970-01-01 00:00:01', '1970-01-01 00:00:01', '2599', 'WUYE_ADMIN_公司总部人员', '公司总部人员', 'MENU', '/companystaff', '', '', '', '1', 'TRUE', 'WUYE_ADMIN');


INSERT INTO `role_permission_relation`
VALUES
  ('3282', '2017-07-22 17:18:07', '2017-07-22 17:18:09', '物业公司管理员', 'WUYE_ADMIN_抽检功能'),
  ('3283', '2017-07-22 17:38:15', '2017-07-22 17:38:17', '物业公司管理员', 'WUYE_ADMIN_抽检任务'),
  ('3284', '2017-07-22 17:38:15', '2017-07-22 17:38:17', '物业公司管理员', 'WUYE_ADMIN_巡更功能'),
  ('3285', '2017-07-22 17:38:15', '2017-07-22 17:38:15', '物业公司管理员', 'WUYE_ADMIN_巡更任务'),
  ('3286', '1970-01-01 00:00:01', '2017-07-22 17:38:15', '物业公司管理员', 'WUYE_ADMIN_公司总部人员');
