import random

person = [
    '是未知浪',
    '黄家驹',
    '谎言',
    '旧城的人',
    '困住了的人',
    '张老师',
    '张学友',
    '刘德华',
    '天空之城',
    '脸',
    '无情',
    '无言',
    '我的天',
]

content = [
    '中国银行、工商银行、建设银行',
    '各位运维同行朋友们，大家好，非常高兴',
    '开始之前，本人首先做一下自我介绍',
    '阿里、腾讯、百度、京东、网易、新浪、搜狐、大众点评、饿了么',
    '大厅灯坏了也没人修理啊',
    '这个物业太差了啊',
    '举报南门岗保安在嗑瓜子',
    '天气不太好啊',
    '风吹草低见牛羊',
    '一幢大门坏了',
    '我们物业什么时候到期啊',
    '呵呵，这个东西太傻了啊',
    '我们的物业太差了，能不能改选啊',
    '物业怎么换届的',
    '我们的物业还行',
]

time = [
    '20171210T08:00:00',
    '20171220T08:02:01',
    '20171220T18:45:00',
    '20171220T09:00:00',
    '20171220T10:00:00',
    '20171221T12:00:00',
    '20171221T08:00:00',
    '20171221T08:02:01',
    '20171221T08:03:00',
    '20171221T09:00:00',
    '20171221T10:00:00',
    '20171221T12:00:00'
]

with open('out.txt', 'a') as f:
    for index in range(0, 200000):
        p = person[random.randint(0, len(person) - 1)]
        c = content[random.randint(0, len(content) - 1)]
        t = time[random.randint(0, len(time) - 1)]

        f.write('{person}|{content}|{time}'.format(person=p, content=c, time=t))
        f.write('\n')
